# Урок 1. Введение в синтаксис

Если вы не знаете, как и где исполнять код, обратитесь к разделу Где работать.

## Задачи

### 1. Когда закончится K-тый урок

Уроки начинаются в 8:00. Урок длится 45 минут и 5 минут перемена. Во сколько закончится k-тый урок \(k&lt;15\). Результат вывести в формате hh:mm

### 2. Длина отрезка

Для отрезка на плоскости ХУ напишите функцию length\(x1, y1, x2, y2\), которая вычисляет расстояние между точками \(x1, y1\) и \(x2, y2\).

Программе на вход подаются координаты x1 y1 x2 y2 \(на одной строке через пробел\).  
Программа печатает расстояние между указанными точками.

### 3. Площадь треугольника \(формула Герона\)

На плоскости ХУ даны координаты вершин треугольника в формате  
x1 y1 x2 y2 x3 y3  
\(на одной строке через пробел\)  
Найдите \(и напечатайте\) площадь этого прямоугольника по формуле Герона

$$s = \sqrt{p \cdot (p - a) \cdot (p - b) \cdot (p - c)}$$

.где a, b, c - длины сторон треугольника, а p = \(a+b+c\)/2 - его полупериметр.

Для этого напишите функцию s\(x1, y1, x2, y2, x3, y3\).

### 4. Часы

Напишите функции  и решите задачи для вывода времени на электронные часы, которые показывают время в формате hh:mm.

#### 4.1 time2min\(h, m\)

Реализуйте функцию time2min\(h, m\), которая переводит часы и минуты в минуты с начала суток \(00:00\).

Проверьте эту функцию.

#### 4.2 min2time\(mm\)

Реализуйте функцию min2time\(mm\), которая минуты с начала суток переводит в часы и минуты \(для показа на электронных часах\).

#### 4.3 Время прибытия электрички

Электричка отправляется в h1:m1 и едет h2:m2. Выведите время прибытия электрички на электронных часах в формате hh:mm.

Формат входных данных: на одной строке h1:m1, на другой h2:m2

#### 4.4 Время в пути

Электричка отправляется в h1:m1 и прибывает в h2:m2. Выведите время в пути электрички в формате hh:mm.

### 5 Делится на 3 или 5, но не на 15

Дано натуральное число. Напечатайте YES, если число делится на 3 или 5, но не делится на 15. В противном случае напечатайте NO.

### 6 Високосный год

Дан год \(натуральное число\). Напечатайте YES, если год високосный. Иначе напечатайте NO.

Год високосный, если он делится на 4, но не делится на 100. Если год делится на 400, то он тоже считается високосным.

### 7 Наибольший общий делитель \(НОД\)

Даны 2 числа. Найдите их НОД по алгоритму Евклида. Найдем НОД для чисел 125 и 21.

125 % 21 = 18  
21 % 18 = 3  
18 % 3 = 1  
НОД\(125, 21\) = 3

### 8 Наименьшее положительное

Даны целые числа. Напечатать наименьшее положительное из них. Если такого числа нет, то ничего не печатать.

Пример чтения нескольких чисел и их печати.

```
a = map(int, input().split())
for x in a:
    print(x)
```

Входные данные:

2 -7 66 1 0 -3

Выходные данные \(печатаем все числа\):

2  
-7  
66  
1  
0  
-3

#### 8.1 Наименьшее положительное \(нет такого\)

Если положительных чисел нет, печатать Nothing

### 9 \(Дополнительная\) Ромашка

Математически угорелая девушка гадает на ромашках о любви. Она срывает ромашку, считает лепестки, вычисляет факториал \(fn=fn-1\* n, где f1=1\) от количества лепестков. Затем подсчитывает сумму цифр полученного числа \(fn\).

Если сумма - простое число, значит ЛЮБИТ, если составное - НЕ ЛЮБИТ.

Девушке попалось поле с ромашками, у которых встречалось все количество лепестков от 1 до \(1 ≤ N ≤ 1000\) по одному разу.

Написать программу, которая по максимальному числу лепестков в ромашке вычисляет сколько раз встречается результат "ЛЮБИТ"

Input format: Целое число \(1 ≤ N ≤ 1000 \) - максимальное число лепестков.

Output format: Целое число \(сколько раз встречается результат "ЛЮБИТ"\)

Примеры:

| Вход | Выход |
| :--- | :--- |
| 1 | 0 |
| 3 | 1 |

Автор: Овсянникова Т.В.

## Методические указания

* Формула Герона - обязательно именно такой формат функции и в функции использовать функцию length, которую написали в предыдущей задаче.
* Часы - использовать функции перевода в минуты и обратно
* Деление и високосный год - попробовать реализовать еще и в виде функции \(без использования and и or\).
* Наименьшее положительное - подумать о None и for .. else



